import डिब्बा

பக்கம்_ஆரம்பு = डिब्बा.पन्ना.पन्ना()

botón_inic = डिब्बा.botón.botón_tx(texto='', acción=None,
                                   स्थान=(0.5, 0.4), आपेक्षिक_स्थान=True, माप=(10, 30), आपेक्षिक_माप=False)
botón_ayuda = डिब्बा.botón.botón_tx(texto='', acción=lambda: பக்கம்_ஆரம்பு.हटाना('उपर'),
                                    स्थान=(0.5, 0.4), आपेक्षिक_स्थान=True, माप=(10, 30), आपेक्षिक_माप=False)

logo = डिब्बा.कला.चित्र.चित्र('Logo_Tiko\'n', स्थान=(0.5, 0.4), आपेक्षिक_स्थान=True, माप=(10, 30), आपेक्षिक_माप=False)

பக்கம்_ஆரம்பு.जोड़ना(logo)

பக்கம்_ஆரம்பு.जोड़ना(botón_ayuda)
பக்கம்_ஆரம்பு.जोड़ना(botón_inic, )
