import डिब्बा

from .mozhigal import பக்கம்_மொழிகள்

பக்கம்_மத்திய = डिब्बा.पन्ना.पन्ना()

தப்பா_மேலே = डिब्बा.डिब्बा.डिब्बा(स्थान=(0, 0), आपेक्षिक_स्थान=False, माप=(1, 50), आपेक्षिक_माप=(True, False))

logo = डिब्बा.कला.चित्र.चित्र('Logo_Tiko\'n', स्थान=(0.5, 0.4), आपेक्षिक_स्थान=True, माप=(30, 40), आपेक्षिक_माप=False)

கோப்பு_விரம்பங்கள் = डिब्बा.नियत्रण.controles_archivo()

botón_மொழி = डिब्बा.botón.botón_चित्र('மொழி',
                                      स्थान=(-20, 0.5), आपेक्षिक_स्थान=(False, True), माप=(10, 10), आपेक्षिक_माप=False,
                                      acción=பக்கம்_மொழிகள்.लाना, args_acción={'dirección': 'बायाँ'})

தப்பா_மேலே.जोड़ना(கோப்பு_விரம்பங்கள்)
தப்பா_மேலே.जोड़ना(logo)
தப்பா_மேலே.जोड़ना(botón_மொழி)

பக்கம்_மத்திய.जोड़ना(தப்பா_மேலே)
