Repository: julienmalard/Tikon
Catalog: docs/source/_local/*/LC_MESSAGES/tutorial/intro.po
Languages: ur

source: Introducción
ur: ابتدائیہ

source: En este ejemplo vamos a construir nuestra propria red trófica de un sistema de coco en Sri Lanka. Para guardar las cosas sencillas no vamos a incluir el cultivo. De todo modo, no tengo modelo de cultivo para árboles de coco.
ur: اس مثال میں ہم اپنا خوراکی جال خود بنائں گے۔ یہ جال سری لانکا میں ناریئل کے کھیت سے ہیے۔ اسمیں فصل نہیں جوڑا دیں گے تاکے ہمہارہ کام آسان رہے۔ اس کے علاوا، میرے پاس ناریئل کا نمونہ نہیں ہیے۔

source: Aquí está un imagen general de los insectos involucrados (3 en total). Tenemos solamente una plaga, y dos parasitoides se atacan a varias etapas de su ciclo de vida.
ur: یہاں سارے شامل ہونے والے کیڑوں (کل ملاکر ۳) دیکھ سکتے ہیں۔ ایک ہی دشمان کیڑا ہیے، اور دو پرجیوی جو اس کی زیندگی کی مختلف مرحلے پر حملہ کرتے ہیں۔

source: Especificar insectos
ur: کیڑوں کی وضاحت

source: Primero especificaremos nuestros insectos presentes, una oruga y dos parasitoides (ver :doc:`insectos` para la lista completa de clases disponibles).
ur: ہم پہلے اپنے کیڑون کی وضاحت کریں گے، ایک تتلی اور دو پرجیویاں (کیڑوں کی دستیاب قسم کی مکمل فہرست دیکھنے کے لئے :doc:`insectos` دیکھنا)۔

source: from tikon.rae.orgs.insectos import MetamCompleta, Parasitoide from tikon.rae.red_ae import RedAE # Mariposas tienen metamórfosis completa Oarenosella = MetamCompleta('O. arenosella', njuvenil=5) # 2 tipos de parasitoides Paras_larvas = Parasitoide('Parasitoide larvas', pupa=True) Paras_pupa = Parasitoide('Parasitoide pupa') # El parasitoide de larvas parasita las fases 3, 4, y 5 de O. arenosela y emergen después de la quinta Paras_larvas.parasita(Oarenosella, ['juvenil_3', 'juvenil_4', 'juvenil_5'], etp_emerg='juvenil_5') # El parasitoide de pupas parasita y emerge de la pupa Paras_pupa.parasita(Oarenosella, 'pupa', etp_emerg='pupa') # Juntamos todo en una red red = RedAE([Oarenosella, Paras_larvas, Paras_pupa])
ur: from tikon.rae.orgs.insectos import MetamCompleta as زندکی_مکمل, Parasitoide as پرجیوی from tikon.rae.red_ae import RedAE as جال # تتلیاں کی زندگیاں مکمل کی ہیں او_ارینوسیلا = زندکی_مکمل('او۔ ارینوسیلا', njuvenil=5) # پرجویوں کی ۲ قسم پرکیوی_لاروا = پرجیوی('پرجیوی لاروا', pupa=True) پرجیوی_پوپا = پرجیوی('پرجیوی پوپا') # پرجیوی او۔ ارینوسیلا کے ۳، ۴، اور ۵ مرحلے میں داخل کرتا ہیے اور ۵ کے باد ابھارتا ہیے۔ پرکیوی_لاروا.parasita(او_ارینوسیلا, ['juvenil_3', 'juvenil_4', 'juvenil_5'], etp_emerg='juvenil_5') # پوپا کی پرجیوی کے داخلا اور خروج پوپا سے ہی ہوتے ہیں۔ پرجیوی_پوپا.parasita(او_ارینوسیلا, 'pupa', etp_emerg='pupa') # سب ایک جال میں جوڑا دتے ہیں۔ میری_جال = جال([او_ارینوسیلا, پرکیوی_لاروا, پرجیوی_پوپا])

source: A prioris
ur: بنفسیہ

source: Un *a priori* es una distribución probable del valor de un parámetro que especificas antes de correr una calibración. Ayuda el algoritmo de calibración a encontrar el mejor valor del parámetro.
ur: ایک *بنفسیہ* ایک تفسیم احتمال ہیے جو تنظیم کے پہلے سے ہی متغیرات کی ممکنہ قیمت کی وضاحت کر دیتا ہیے۔ متغیر کے سحی قیمت کی تلاش میں تنظیمی الخوارزم کی مدد کرتا ہیے۔

source: Aquí vamos a cargar las distribuciones a prioris para los parámetros de la red. Los tienes que especificar manualmente para cada experimento.
ur: یہاں ہم اپنے جال کی متغیرات کے بنفیسہ تفسیم احتمال جوڑا دیں گے۔ ہر تجربہ کے لئے انکے وضاحت دستی تور پر کرنی ہیے۔

source: Es **muy importante** establecer buenos *a prioris* para calibraciones. Las limitaciones de algoritmos existentes de calibración de estos tipos de modelos hacen primordial la especificación de *a prioris* razonables y bastante precisos para todos los parámetros del modelo.
ur: تنظیم کے لئے، اچھے *بنفسیہ* کی وضاحت **بہت ہی اہم ہیے**۔ آجکل کے تنظیمی الخوارزم نمونہ کے ہر ایک متغیر کے لئے معقول اور عین مطابق *بنفسیہ* کے بغیر اس ترف کے نمونے کی تنظیم نہیں کر پائے گا۔

source: Nota para estudiantes: Mejorar estos algoritmos podría ser buena idea de tesis. :)
ur: طالب علم کے لئے: مقالہ کے لئے بھہتر الخوارزم کی تلاش بہت اچھی مضموع ہو سکتی ہیے. :)

source: En este caso ya especificamos nuestros a prioris en un documento separado así que los vamos a cargar directamente.
ur: یہاں ہمنے اپنے بنفسیہ کے وضاحت الگ مسل میں کر چکے ہیں، تو انہیں سیدھے کھولیں گے۔

source: from tikon.ejemplos.opisina_arenosella.a_prioris import a_prioris red.espec_aprioris(a_prioris)
ur: from tikon.ejemplos.opisina_arenosella.a_prioris import a_prioris as بنفسیہ جال.espec_aprioris(بنفسیہ)

source: El experimento
ur: تجربہ

source: Aquí se conecta la red con observaciones de campo a través de un experimento (:class:`~tikon.exper.exper.Exper`).
ur: ہیاں ایک تجربہ (:class:`~tikon.exper.exper.Exper`) کے ذریعے سے جال کو کھیت کی مشاہدات سے جوڑا دیں گے.

source: from tikon.ejemplos.datos import obt_datos, obt_ref from tikon.exper.exper import Exper from tikon.rae.red_ae.obs import ObsPobs # Datos de observaciones datos = obt_datos('Perera et al 1988/Oarenosella_A.csv') # También se puede visualisar la referencia para los datos print(obt_ref('Perera et al 1988/Oarenosella_A.csv')) # Se trata de observaciones de poblaciones (y no de otro variable, como depredación). pobs = ObsPobs.de_csv( datos, col_tiempo='Día', corresp={ 'Estado 1': Oarenosella['juvenil_1'], 'Estado 2': Oarenosella['juvenil_2'], 'Estado 3': Oarenosella['juvenil_3'], 'Estado 4': Oarenosella['juvenil_4'], 'Estado 5': Oarenosella['juvenil_5'], 'Pupa': Oarenosella['pupa'], 'Para_larva_abs': Paras_larvas['juvenil'], 'Para_pupa_abs': Paras_pupa['juvenil'] }, factor=655757.1429 / 500 # para convertir a individuos por ha ) exper_A = Exper('Sitio A', pobs)
ur: from tikon.ejemplos.datos import obt_datos as کوائف_پانا, obt_ref as حوالہ_پانا from tikon.exper.exper import Exper as تجربہ from tikon.rae.red_ae.obs import ObsPobs as آبادی_مشاہدات # مشاہدات کے کوائف کوائف = کوائف_پانا('Perera et al 1988/Oarenosella_A.csv') # مشاہدات کی حوالہ بھی دیکھ سکتے ہیں print(حوالہ_پانا('Perera et al 1988/Oarenosella_A.csv')) # ہمہارے مشاہدات آبادی کے ہی ہیں، (اور دوسری متغیرات کے نہیں، جیسے کے شراک) آبادی = آبادی_مشاہدات.de_csv( datos, col_tiempo='Día', corresp={ 'Estado 1': او_ارینوسیلا['juvenil_1'], 'Estado 2': او_ارینوسیلا['juvenil_2'], 'Estado 3': او_ارینوسیلا['juvenil_3'], 'Estado 4': او_ارینوسیلا['juvenil_4'], 'Estado 5': او_ارینوسیلا['juvenil_5'], 'Pupa': او_ارینوسیلا['pupa'], 'Para_larva_abs': پرجیوی_لاروا['juvenil'], 'Para_pupa_abs': پرجیوی_پوپا['juvenil'] }, factor=655757.1429 / 500 # para convertir a individuos por ha ) تجربہ_ا = تجربہ('Sitio A', pobs)

source: Calibración
ur: تنظیم

source: Ahora vamos a calibrar nuestro modelo. Primero creamos un :class:`~tikon.central.simulador.Simulador` para poder correr simulaciones y calibraciones. En nuestro ejemplo sencillo el simulador solamente tiene un módulo (la red), pero se podrían incluir clima, manejo, o cultivos también.
ur: اب ہم اپنے نمونے کی تنظیم کریں گے۔ پہلہ ایک نمونہ (:class:`~tikon.central.simulador.Simulador`) بنائں گے جس سے تنظیم اور نقلیاں کی جا سکتی ہیں۔ ہمہارے مثال میں نقلیوالا میں صرف ایک حصہ ہیے (جال)، پر چاہے تو موسم، انتظام اور فصل بھی جوڑے جا سکتے ہیں۔

source: from tikon.central.simulador import Simulador simul = Simulador(red) simul.calibrar('Sitio A', exper=exper_A)
ur: from tikon.central.simulador import Simulador as نقلیوالا نقلی = نقلیوالا(میری_جال) نقلی.calibrar('جگہ ا', exper=تجربہ_ا)

source: Validación
ur: تصدیق

source: En este ejemplo vamos a hacer trampa y validar con los mismos datos de calibración. Primero hacemos una simulación normal, y despues vamos a :func:`~tikon.datos.res.ResultadosSimul.validar` los resultados. También los podremos :func:`~tikon.datos.res.ResultadosSimul.graficar`.
ur: اس مثال میں ہم تھوڑا دھوکے دیں گے اور تنظیم اور تصدیق دونوں کے لئے ایک ہی کوائف کا استعمال کریں گے۔ پہلے ہم ایک عام نقلی کریں گے، اور بعاد میں اپنے نتائج کی تصدیق (:func:`~tikon.datos.res.ResultadosSimul.validar`) کریں گے۔ انکے تصویر بھی بنا سکیں گے (:func:`~tikon.datos.res.ResultadosSimul.graficar`)۔

source: Las observaciones especificadas arriba quedaron vinculadas en los resultados y por eso se tomarán en cuenta en la validación y en los gráficos.
ur: اوپر وصاحت کی گئی مشاہدات نتائج کے ساتھ جوڑی رہتی ہیں۔ اسی لئے تصدیق اور تصویروں میں بھی شامل ہوں گی۔

source: res = simul.simular(exper=exper_A) from pprint import pprint pprint(res.validar()) res.graficar('gráficos Sitio A')
ur: نتیجہ = نقلی.simular(exper=تجربہ_ا) from pprint import pprint pprint(نتیجہ.validar()) نتیجہ.graficar('تصویریں جگہ ا')

source: Tiko'n generará un gráfico para cada insecto de la red, con su población predicha, los márgenes de incertidumbre y las observaciones, si hay.
ur: تیکون جال کے ہر ایک کیڑے کے لئے ایک تصویر بنا لیگا، جس میں کیڑے کا پیشن گوئی آبادی، اسکا غیر یقینی اور، اگار ہیے، اسکے مشاہدات شامل ہو جائیں گے۔

source: Guardar y cargar
ur: تحفوظ کرنا اور کھولنا

source: Vamos a guardar los resultados de la calibración para ahorar tiempo en el futuro. Tiko'n calibra automáticamente las poblaciones iniciales para etapas cuyas poblaciones no se observaron en el experimento, así que guardaremos la calibración del experimento también.
ur: تنظیم کے نتائج کی تحفوظ کریں گے تکہ اگے زیادہ جلدی ہو جائیں۔ تیکوں خودکار تریقہ سے ان ابتدائی آبادیوں کی تنظیم بھی کر دیتا ہیے جن کے کوائف تجربہ کے مشاہدات میں نہ ہو۔ اسی لئے ہم تجربہ کی تنظیم کی تحفوظ بھی کریں گے۔

source: simul.guardar_calib('calibs Sitio A') exper_A.guardar_calib('calibs Sitio A')
ur: نقلی.guardar_calib('تنظیم جگہ ا') تجربہ_ا.guardar_calib('تنظیم جگہ ا')

source: Se pueden después cargar las calibraciones para más trabajo. Igualmente se pueden compartir entre usuarias de Tiko'n. Por ejemplo, en otra sesión de Python:
ur: بعاد میں تنظیم کو کھولکے اور کام کر سکتے ہیے۔ تیکون کے دوسرے صارفوں کے ساتھ بانٹ کی جا سکتی ہیں بھی۔ مثال کے تور پر، پایتھون دبارہ کھولنے کے بعاد:

source: red.cargar_calib('calibs Sitio A') exper_A.cargar_calib('calibs Sitio A') red.simular(exper=exper_A)
ur: جال.cargar_calib('تنظیم جگہ ا') تجربہ_ا.cargar_calib('تنظیم جگہ ا') جال.simular(exper=تجربہ_ا)

source: Igualmente puedes guardar tu calibración al directorio de Tiko'n. Será después disponible para todas los usuarios de tu instalación de Tiko'n. Si quieres, también lo puedes compartir en GitHub con el resto de la comunidad de Tiko'n.
ur: ٓپکی تنظیم کے تحفوظ کیتون کے اندر بھہ کی جا سکتی ہیے تکہ باکی باکی صارفوں کے لئے بھی دستیاب ہو جائں۔ چاہئے تو انہیں گٹھب پر بانٹ سکتے ہیں تکہ تیکون کے سارے صارفوں کو دستیاب میلیں۔

source: from tikon.ejemplos.calibs import guardar_calib guardar_calib( [red, exper_A], 'Opisina arenosella, Perera et al. 1988', autor='Yo :)' correo='julien.malard@mail.mcgill.ca', detalles='Calibración con Sitio A' )
ur: from tikon.ejemplos.calibs import تنظیم_محفوظ تنظیم_محفوظ( [جال, تجربہ_ا], 'Opisina arenosella, Perera et al. 1988', autor='میں :)' correo='julien.malard@mail.mcgill.ca', detalles='جگہ ا کے ساتھ تنظیم' )

source: Después se podrá acceder con:
ur: اسکے بعاد انہیں ایسا پا سکتے ہیں:

source: from tikon.ejemplos.calibs import obt_calib, obt_ref dir_ = 'Opisina arenosella, Perera et al. 1988' red.cargar_calib(obt_calib(dir_)) exper_A.cargar_calib(obt_calib(dir_)) # Visualizar la información de la calibración print(obt_ref(dir_))
ur: from tikon.ejemplos.calibs import obt_calib as تنظیم_پانا, obt_ref as حوالہ_پانا راستہ = obt_calib('Opisina arenosella, Perera et al. 1988') جال.cargar_calib(راستہ) تجربہ_ا.cargar_calib(راستہ) # تنظیم کی معالمات بھی دیکھ سکتے ہیں print(حوالہ_پانا(راستہ))
