Repository: julienmalard/Tikon
Catalog: docs/source/_local/*/LC_MESSAGES/tutorial/manejo.po
Languages: ur

source: Manejo
ur: انتظام

source: En Tiko'n, *manejo* se refiere a acciones que toman humanos para modificar el sistema agrícola.
ur: تیکون میں، *انتظام* کا معنی ہیے ہر عمل جو انسان زرعی نظام کی تبدیل کرنے کے لئے لیتا ہیے۔

source: Aquí vamos a predecir el impacto de biocontrol con el modelo de *Opisina arenosella* que ya desarrollamos.
ur: اب ہمہارے *اوپیسینا ارینوسیلا* کے نمونے کے ساتھ جیاتیاتی انتظام کے تثرات کے پیشن گوئی کریں گے۔

source: Cómo funciona
ur: کام کیسے کرتا ہیے

source: Una **regla** (:class:`~tikon.manejo.manejo.Regla`) tiene dos componentes: una **condición** (:class:`~tikon.manejo.conds.Condición`) y una o más **acciones** (:class:`~tikon.manejo.acciones.Acción`). Cuando se cumple la condición, Tiko'n ejecutará el acción. ¡Sencillo!
ur: **قواعد** (:class:`~tikon.manejo.manejo.Regla`) کے دو حصے ہیں: ایک **امتحان** (:class:`~tikon.manejo.conds.Condición`) اور مختلف **اعمال** (:class:`~tikon.manejo.acciones.Acción`)۔ جب امتحان سچ ہیے، پھر تیکون عمل کر لیگا۔ بلکل آسان!

source: Las condiciones pueden ser según el tiempo (:class:`~tikon.manejo.conds.CondTiempo` y :class:`~tikon.manejo.conds.CondCada`) o según el valor de un variable particular (:class:`~tikon.manejo.conds.CondVariable`). Igualmente puedes combinar varias condiciones con :class:`~tikon.manejo.conds.CondY` y :class:`~tikon.manejo.conds.CondO`.
ur: امتحان وقت کے ہو سکتے ہیں (:class:`~tikon.manejo.conds.CondTiempo` y :class:`~tikon.manejo.conds.CondCada`) یا ایک متغیر کی قیمت کے لحاص سے ہو سکتے ہیں (:class:`~tikon.manejo.conds.CondVariable`)۔ مختلف امتحانات :class:`~tikon.manejo.conds.CondY` اور :class:`~tikon.manejo.conds.CondO` سے جوڑی جا سکتی ہیں۔

source: Las condiciones basades en valores de variables se evaluan **separadamente** para cada repetición estocástica y paramétrica del modelo.
ur: متغیرات کے لحاص سے امتحانات کی تشخیس ہر ترتیبی اور متغیرات کی تکرار میں انفرادی طور پر کی جائے گی۔

source: Biocontrol
ur: جیاتیاتی انتظام

source: Primero cargamos el modelo y sus calibraciones.
ur: پہلے مرحلے میں ہم اپنے نمونے اور اسکے تنظیم کھول دیں گے۔

source: Ahora vamos a soltar parasitoides de *O. arenosella* cada 30 días.
ur: اب ہم ہر ۳۰ دن *او۔ ارینوسیلا* کے پرجیوی کی رہا کریں گے۔

source: También podemos hacer control biológico más inteligente, y solamente soltar parasitoides cuando la población de *O. arenosella* sube demasiado. En este ejemplo soltamos 200000 parasitoides adultos por hectárea cada vez que tenemos una población de pupas de *O. arenosella* superior a 200000. Igualmente esperamos 30 días después de una aplicación de parasitoides antes de poder considerar una nueva aplicación.
ur: اگر ہمہیں اور ہوشیار ہونا ہیے، پھر پرجیوی کی رہا تب ہی کریں جب ہی *او۔ ارینوسیلا* کی آبادی ایک حد تک پہنچتی ہیے۔ اس مثال میں ہم ہر ہیکٹر کو ۲۰۰۰۰۰ بالغ پرجیویوں کی رہا کریں گے ہر دفہ کے *او۔ ارینوسیلا* کے پوپا کی آبادی ۲۰۰۰۰۰ سے زیادہ ہوتی ہیے۔ دو رہا کے درمیان میں ہم کم سے کم ۳۰ دن کا انتظار کریں گے۔

source: from tikon.manejo.conds import CondPoblación, SuperiorOIgual acción = AgregarPob(mod.Paras_pupa['adulto'], 200000) cond = CondPoblación(mod.Oarenosella['pupa'], SuperiorOIgual(200000), espera=30) manejo_dinámico = Manejo(Regla(cond, acción)) simul = Simulador([mod.red, manejo_dinámico]) res_dinámicos = simul.simular(400, exper=mod.exper_A, n_rep_estoc=5) res_dinámicos.graficar('mis resultados aquí/dinámicos')
ur: from tikon.manejo.conds import CondPoblación as امتحان_آبادی, SuperiorOIgual as برابر_یا_زیادہ عمل = آبادی_جوڑانا(نمونہ_او_ارینوسیلا.Paras_pupa['adulto'], 200000) امتحان = امتحان_آبادی(نمونہ_او_ارینوسیلا.Oarenosella['pupa'], برابر_یا_زیادہ(200000), espera=30) متحرک_انتظام = انتظام(قواعد(امتحان, امتحان)) نمونہ = Simulador([mod.red, متحرک_انتظام]) نتائج_متحرک = نمونہ.simular(400, exper=نمونہ_او_ارینوسیلا.exper_A, n_rep_estoc=5) نتائج_متحرک.graficar('میرے نتائج/متحرک')
