Repository: julienmalard/Tikon
Catalog: docs/source/_local/*/LC_MESSAGES/general/agrad.po
Languages: ur

source: Agradecimientos
ur: شکریہ

source: Tiko'n es un proyecto de fuente abierta. Las personas e instituciones siguientes hicieron posible su desarrollo.
ur: تیکون ازاد مصدر کا ہیے۔ درج ذیل انسان اور اداروں کی وجے سے ہی اسکی ترقی ممکن ہوی۔

source: Autores del código
ur: مصنف

source: Julien Malard (`Sitio internet <https://www.researchgate.net/profile/Julien_Malard>`_)
ur: ژولیئں ملاغ (`معلومات <https://www.researchgate.net/profile/Julien_Malard>`_)

source: Marcela Rojas (`Sitio internet <https://www.researchgate.net/profile/Marcela_Rojas5>`_)
ur: مارسیلا روحاس (`معلومات <https://www.researchgate.net/profile/Marcela_Rojas5>`_)

source: Traductores
ur: ترجمہ

source: Instituciones afiliadas
ur: الحاق شدہ ادارے

source: Tiko'n se desarrolla en colaboración con las instituciones siguientes:
ur: تیکوں کی ترقی درج ذیل اداروں کے ساتھ ہو رہی ہیے:

source: Financiamiento
ur: مالیات

source: Los organismos siguientes contribuyeron apoyo financiero a uno o más de los autores del código mientras trabajaban en el desarrollo de Tiko'n:
ur: مندرجہ ذیل ادارہ تیکون کے مصنفوں کو مالیاتی مدد دئے جب وہ تیکون پر کام کر رہے تھے۔
