Repository: julienmalard/Tikon
Catalog: docs/source/_local/*/LC_MESSAGES/index.po
Languages: hi

source: General
hi: सामान्य

source: Tutorial
hi: सीखना

source: Desarrollo
hi: विकास

source: Referencia
hi: संदर्भ

source: ¿Qué es Tiko'n?
hi: तिकोन है क्या।

source: Tiko'n es un programa para desarrollar modelos de redes tróficas agroecológicas de manera sencilla, reproducible y divertida.
hi: तिकोन एक संगणक कार्यक्रम है जिस से आसान, पुनरुत्पादनीय और मज़ेदार तरह से खाद्य जाल के प्रतिरूप की विकास होती है।

source: ¿Qué es un modelo de redes tróficas?
hi: खाद्य जाल की प्रतिरूप क्या हैं फ़िर।

source: Un modelo de redes tróficas es un modelo que representa las interacciones entre organismos vivos en un campo agrícola (en general insectos y otros artrópodos). Predice el nivel de control biológico natural, las presiones futuras de plagas dado factores como el clima y la presencia de insectos benéficos, y hacia permite predecir cuáles serían los impacto de varias estrategias de manejo de plagas.
hi: खाद्य जाल का प्रतिरूप ऐसा एक प्रतिरूप है जो खेत में सारी रहनेवाली जीव (आम तोर पर कीड़े और दूसरे सन्धिपादें) के बीच में संबंध का प्रतिनिधित्व करता है। प्राकृतिक जीवती नियंत्रण का स्तर, मौसम और सहायक कीड़ों जैसे कारक के अनुसर भविष्य में फसल खानेवाले कीड़ों की जोखिम, और नियंत्रण रणनीति के प्रभाव सारे का भविष्यवाणी करता है।

source: ¿Por qué utilizar Tiko'n?
hi: तिकोन का प्रयोग क्यों करें।

source: Redes tróficas con cosas muy difíciles a modelizar. Aun las más sencillas (3 insectos) presentan problemas como
hi: खाद्य जाल के प्रतिरूप करने बहुत मुश्किल हो सकता है। सरल जाल में (कहें ३ ही कीड़े के) भी निम्नलिखित कठिनाइयाँ आएँगी-

source: Multitud de parámetros (15+ por insecto)
hi: बहुत परिवर्तनशील (हर कीड़े को १५ से ज़्यादा)

source: Inestabilidad matemática (dificultando predicciones fiables)
hi: परिरूप की गणितीय अस्थिरता (विश्वसनीय पूर्वानुमान पाने मे कठिनाइयाँ)

source: Multitud de posibilidades de ecuaciones en la literatura para cada fase de vida (reproducción, edad, transiciones, muertes, depredación)
hi: कीड़ों के हर एक जीवन चरण (प्रजनन, उम्र, संक्रमण, मौत, शिकार) के समीकरण के लिये साहित्य में विभिन्न संभावनाएं।

source: Muy alta incertidumbre en los valores verdaderos de los parámetros
hi: परिवर्तनशील की असली मूल्य में ऊंची अनिश्चितता

source: Pocos datos para calibración y validación
hi: अंशशोधन और विधिमान्यकरण के आँकड़ों की कमी

source: Requerimiento de conocimientos informáticos avanzados para conectar con modelos de cultivos externos o con predicciones de cambios climáticos
hi: जलवायु परिवर्तण के भविष्यवाणी और बाहरी फसल के नमूनों के साथ जोड़ाने के लिये उन्नत कौशल की ज़रूरी

source: Así que si quieres hacer modelos tróficos pero te desaniman estos retos, ¡Tiko'n es para ti! Tiko'n manejará todos los puntos arriba para ti, siempre dándote el nivel de control que quieres sobre los detalles de tu modelo, nada menos, nada más.
hi: तो अगर आप खाद्य जाल के प्रतिरूप बनानेे चाहते हैं पर उपरिलिखित चुनौतियों से डरते हैं, फिर तीकोन आपके लिये ही है। तीकोन सारे इन चीज़ों का प्रबंधन आपके लिये करेगा और हमेशा अपने नमूने के विवरण के उपर आपको उतने ही नियंत्रण देगा जीतने आप चाहती हैं।

source: Posibilidad de agregar tus propias ecuaciones si quieres
hi: चाहें तो खुद के समीकरण जोड़ाने की संभावना

source: Conexión automática con bases de datos y con predicciones y observaciones climáticas
hi: आँकड़ों और जलवायु के भविष्यवाणी और प्रेक्षण के साथ जोड़ाई

source: Manejo automático de parametros y de cálculos de poblaciones y de depredación
hi: परिवर्नशील और जनसंख्या और शिकारी के गणना के स्वचालित प्रबंधन

source: Funcionalidades integradas para calibración y validación de modelos
hi: प्रतिरूप के अंशांकन और पुष्टीकरण के लिये एकीकृत कार्यक्षमते

source: Y, por supuesto, gráficos bonitos
hi: और, बिलकुल, सुंदर रेखा-चित्र

source: Contenido
hi: समाग्री
